## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_cloudformation_stack.notification_history`        |
|        | `aws_quicksight_refresh_schedule.notification_history` |
| update | `aws_cloudformation_stack.notifications`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack.notification_history will be created
  + resource "aws_cloudformation_stack" "notification_history" {
      + id                = (known after apply)
      + name              = "notification-history"
      + notification_arns = [
          + "arn:aws:sns:ca-central-1:239043911459:aws-controltower-SecurityNotifications",
        ]
      + outputs           = (known after apply)
      + parameters        = (known after apply)
      + policy_body       = (known after apply)
      + tags_all          = (known after apply)
      + template_body     = jsonencode(
            {
              + Resources = {
                  + notificationHistoryJoined = {
                      + Properties = {
                          + AwsAccountId              = "239043911459"
                          + DataSetId                 = "notification-history"
                          + DataSetUsageConfiguration = {
                              + DisableUseAsDirectQuerySource = false
                              + DisableUseAsImportedSource    = false
                            }
                          + ImportMode                = "SPICE"
                          + LogicalTableMap           = {
                              + nj-notification-history                        = {
                                  + Alias          = "nj-notification-history"
                                  + DataTransforms = [
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "id"
                                              + NewColumnName = "notification_id"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "created_at"
                                              + NewColumnName = "notification_created_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "sent_at"
                                              + NewColumnName = "notification_sent_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "updated_at"
                                              + NewColumnName = "notification_updated_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "queue_name"
                                              + NewColumnName = "notification_queue_name"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "key_type"
                                              + NewColumnName = "api_key_type"
                                            }
                                        },
                                    ]
                                  + Source         = {
                                      + PhysicalTableId = "nj-notification-history-physical"
                                    }
                                }
                              + nj-notification-history-services               = {
                                  + Alias  = "nj-notification-history-services"
                                  + Source = {
                                      + JoinInstruction = {
                                          + LeftOperand  = "nj-notification-history"
                                          + OnClause     = "{service_id} = {id[Services]}"
                                          + RightOperand = "nj-services"
                                          + Type         = "LEFT"
                                        }
                                    }
                                }
                              + nj-notification-history-services-org           = {
                                  + Alias  = "nj-notification-history-services-org"
                                  + Source = {
                                      + JoinInstruction = {
                                          + LeftOperand  = "nj-notification-history-services"
                                          + OnClause     = "{organisation_id} = {id[Organisation]}"
                                          + RightOperand = "nj-organisation"
                                          + Type         = "LEFT"
                                        }
                                    }
                                }
                              + nj-notification-history-services-org-templates = {
                                  + Alias          = "nj-notification-history-services-org-templates"
                                  + DataTransforms = [
                                      + {
                                          + ProjectOperation = {
                                              + ProjectedColumns = [
                                                  + "notification_id",
                                                  + "notification_created_at",
                                                  + "notification_sent_at",
                                                  + "notification_updated_at",
                                                  + "notification_type",
                                                  + "notification_status",
                                                  + "notification_queue_name",
                                                  + "job_id",
                                                  + "api_key_id",
                                                  + "api_key_type",
                                                  + "service_id",
                                                  + "service_active",
                                                  + "service_count_as_live",
                                                  + "service_go_live_at",
                                                  + "service_name",
                                                  + "service_message_limit",
                                                  + "service_rate_limit",
                                                  + "service_sms_daily_limit",
                                                  + "template_id",
                                                  + "template_version",
                                                  + "template_name",
                                                  + "template_created_at",
                                                  + "template_updated_at",
                                                  + "organisation_name",
                                                  + "organisation_id",
                                                ]
                                            }
                                        },
                                    ]
                                  + Source         = {
                                      + JoinInstruction = {
                                          + LeftOperand  = "nj-notification-history-services-org"
                                          + OnClause     = "{template_id} = {id[Templates]}"
                                          + RightOperand = "nj-templates"
                                          + Type         = "LEFT"
                                        }
                                    }
                                }
                              + nj-organisation                                = {
                                  + Alias          = "nj-organisation"
                                  + DataTransforms = [
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "id"
                                              + NewColumnName = "id[Organisation]"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "created_at"
                                              + NewColumnName = "organisation_created_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "updated_at"
                                              + NewColumnName = "organisation_updated_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "name"
                                              + NewColumnName = "organisation_name"
                                            }
                                        },
                                    ]
                                  + Source         = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:239043911459:dataset/organisation"
                                    }
                                }
                              + nj-services                                    = {
                                  + Alias          = "nj-services"
                                  + DataTransforms = [
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "id"
                                              + NewColumnName = "id[Services]"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "updated_at"
                                              + NewColumnName = "service_updated_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "created_at"
                                              + NewColumnName = "service_created_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "active"
                                              + NewColumnName = "service_active"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "count_as_live"
                                              + NewColumnName = "service_count_as_live"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "go_live_at"
                                              + NewColumnName = "service_go_live_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "name"
                                              + NewColumnName = "service_name"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "message_limit"
                                              + NewColumnName = "service_message_limit"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "rate_limit"
                                              + NewColumnName = "service_rate_limit"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "sms_daily_limit"
                                              + NewColumnName = "service_sms_daily_limit"
                                            }
                                        },
                                    ]
                                  + Source         = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:239043911459:dataset/services"
                                    }
                                }
                              + nj-templates                                   = {
                                  + Alias          = "nj-templates"
                                  + DataTransforms = [
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "id"
                                              + NewColumnName = "id[Templates]"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "version"
                                              + NewColumnName = "template[Templates]"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "service_id"
                                              + NewColumnName = "template_service_id"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "updated_at"
                                              + NewColumnName = "template_updated_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "created_at"
                                              + NewColumnName = "template_created_at"
                                            }
                                        },
                                      + {
                                          + RenameColumnOperation = {
                                              + ColumnName    = "name"
                                              + NewColumnName = "template_name"
                                            }
                                        },
                                    ]
                                  + Source         = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:239043911459:dataset/templatesv2"
                                    }
                                }
                            }
                          + Name                      = "Notification History"
                          + Permissions               = [
                              + {
                                  + Actions   = [
                                      + "quicksight:DescribeDataSet",
                                      + "quicksight:DescribeDataSetPermissions",
                                      + "quicksight:DescribeIngestion",
                                      + "quicksight:ListIngestions",
                                      + "quicksight:PassDataSet",
                                    ]
                                  + Principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
                                },
                              + {
                                  + Actions   = [
                                      + "quicksight:DescribeDataSet",
                                      + "quicksight:DescribeDataSetPermissions",
                                      + "quicksight:DescribeIngestion",
                                      + "quicksight:ListIngestions",
                                      + "quicksight:PassDataSet",
                                      + "quicksight:DeleteDataSet",
                                      + "quicksight:UpdateDataSet",
                                      + "quicksight:UpdateDataSetPermissions",
                                      + "quicksight:CreateIngestion",
                                      + "quicksight:CancelIngestion",
                                    ]
                                  + Principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
                                },
                            ]
                          + PhysicalTableMap          = {
                              + nj-notification-history-physical = {
                                  + RelationalTable = {
                                      + DataSourceArn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
                                      + InputColumns  = [
                                          + {
                                              + Name = "id"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "job_id"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "service_id"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "template_id"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "created_at"
                                              + Type = "DATETIME"
                                            },
                                          + {
                                              + Name = "sent_at"
                                              + Type = "DATETIME"
                                            },
                                          + {
                                              + Name = "sent_by"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "updated_at"
                                              + Type = "DATETIME"
                                            },
                                          + {
                                              + Name = "template_version"
                                              + Type = "INTEGER"
                                            },
                                          + {
                                              + Name = "api_key_id"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "key_type"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "notification_type"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "notification_status"
                                              + Type = "STRING"
                                            },
                                          + {
                                              + Name = "queue_name"
                                              + Type = "STRING"
                                            },
                                        ]
                                      + Name          = "notification_history"
                                    }
                                }
                            }
                        }
                      + Type       = "AWS::QuickSight::DataSet"
                    }
                }
            }
        )
    }

  # aws_cloudformation_stack.notifications will be updated in-place
  ~ resource "aws_cloudformation_stack" "notifications" {
        id                 = "arn:aws:cloudformation:ca-central-1:239043911459:stack/notifications/a583c630-92d5-11ee-b86e-06c06cc50e20"
        name               = "notifications"
      ~ outputs            = {} -> (known after apply)
        tags               = {}
      ~ template_body      = jsonencode(
          ~ {
              ~ Resources = {
                  ~ notificationsJoined = {
                      ~ Properties = {
                          ~ PhysicalTableMap          = {
                              ~ nj-notifications-physical = {
                                  ~ RelationalTable = {
                                      ~ InputColumns  = [
                                            {
                                                Name = "id"
                                                Type = "STRING"
                                            },
                                          - {
                                              - Name = "to"
                                              - Type = "STRING"
                                            },
                                            {
                                                Name = "job_id"
                                                Type = "STRING"
                                            },
                                            # (12 unchanged elements hidden)
                                        ]
                                        # (2 unchanged attributes hidden)
                                    }
                                }
                            }
                            # (7 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                }
            }
        )
        # (5 unchanged attributes hidden)
    }

  # aws_quicksight_refresh_schedule.notification_history will be created
  + resource "aws_quicksight_refresh_schedule" "notification_history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notification-history"
      + id             = (known after apply)
      + schedule_id    = "schedule-notification-history"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "05:10"
              + timezone        = (known after apply)
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

32 tests, 19 passed, 13 warnings, 0 failures, 0 exceptions

```

</details>
